src/test/resources/request1.xml

<?xml version="1.0" encoding="UTF-8"?> <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns1="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1"><soapenv:Header/><soapenv:Body><ns:SendRequestRequest><ns:SendRequestRequestData Id=""><ns:MessageID/><ns:ReferenceMessageID/><ns:TransactionCode/><ns:NodeID/><ns:EOL/><ns1:MessagePrimaryContent/><ns:PersonalSignature/><ns1:AttachmentHeaderList><ns1:AttachmentHeader><ns1:contentId/><ns1:MimeType/><ns1:SignaturePKCS7/></ns1:AttachmentHeader></ns1:AttachmentHeaderList><ns1:RefAttachmentHeaderList><ns1:RefAttachmentHeader><ns1:RefAttachmentHeader/><ns1:RefAttachmentHeader/><ns1:RefAttachmentHeader/><ns1:SignaturePKCS7/></ns1:RefAttachmentHeader></ns1:RefAttachmentHeaderList><ns:BusinessProcessMetadata/><ns:TestMessage/></ns:SendRequestRequestData><ns1:AttachmentContentList><ns1:AttachmentContent><ns1:Id/><ns1:Content/></ns1:AttachmentContent></ns1:AttachmentContentList><ns:CallerInformationSystemSignature/></ns:SendRequestRequest></soapenv:Body></soapenv:Envelope>
